controllers/CastingController.php

SELECT * FROM `casting` WHERE `id`='2'
---
    public function actionIndex()
    {
        $searchModel = new CastingSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

            // validate if there is a editable input saved via AJAX
        if (Yii::$app->request->post('hasEditable')) {
            // instantiate your book model for saving
            $edita = Yii::$app->request->post('editableKey');
            $model = Casting::findOne($edita);